&НаКлиенте
Процедура фФильтрГодВыпускаПриИзменении(Элемент)
	ПоказатьОтчетНаКлиенте();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоставитьМассив(пМаксимальныйЭлемент, пЭлементов, пШаг = 1)
	вМассив = Новый Массив;
	мЭлемент = пМаксимальныйЭлемент;
	
	Пока вМассив.Количество() < пЭлементов Цикл
		вМассив.Добавить(мЭлемент);
		мЭлемент = мЭлемент - пШаг;
	КонецЦикла;
	вМассив.Вставить(0, 0);
	Возврат вМассив;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗапуститьПолучениеДанныхВФоне(Стр)
	
	п = СтрЗаменить(Стр.ВнутреннийАдрес,":",Символы.ПС);
	Сервер = СтрПолучитьСтроку(п,1);
	порт = СтрПолучитьСтроку(п,2);
	Если порт = "" ТОгда Порт = "80"; КонецЕсли;
	порт = Число(порт);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено,Новый УникальныйИдентификатор);
	
	масПар = Новый Массив;
	масПар.Добавить(Сервер);
	масПар.Добавить(Порт);
	масПар.Добавить("/"+Стр.APIrestENT+"/hs/"+Стр.ИмяАпиПроизводства+"/DATAPROZR");
	масПар.Добавить(АдресВХранилище);
	масПар.Добавить(Неопределено);
	
	фз = ФоновыеЗадания.Выполнить("глСервер.выполнитьAPI", масПар, АдресВХранилище);
	
	Стр.Ключ = АдресВХранилище;
	Стр.ид = фз.УникальныйИдентификатор;
	Стр.Выполнено = Ложь;
	
КонецПроцедуры      

&НаСервереБезКонтекста
Функция ПолучитьТаблицуОрганизаций()
	Возврат XMLЗначение(Тип("ХранилищеЗначения"), Рсш_Поток_Общий.ТаблицаЗапросовПрозрачность()).Получить();
	//мАдресТекущегоСервера = мСтруктураСоединения.Srvr
	//мИмяТекущейБазы = 
	//глСервер.ВыполнитьAPI(мАдресТекущегоСервера, 80, "/" + мИмяТекущейБазы + "/hs/flowAPI/GETTRANSPDATATABLE", мВременныйАдрес, Неопределено);
	//Возврат ПолучитьИзВременногоХранилища(мВременныйАдрес);
КонецФункции



&НаСервере
Процедура ДобавитьОрганизациюИзСтруктуры(пСтруктура)
	мНоваяСтрока = тблБаз.Добавить();
	ЗаполнитьЗначенияСвойств(мНоваяСтрока, пСтруктура);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеОрганизаций()
	Для Каждого мСтрока Из тблБаз Цикл
		мДекорацияОрганизации = Элементы.Добавить("элФ" + тблБаз.Индекс(мСтрока), Тип("ДекорацияФормы"), Элементы.грпОрг);
		мДекорацияОрганизации.Заголовок = мСтрока.Наименование;
		мДекорацияОрганизации.ЦветТекста = WebЦвета.Серый;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьОрганизациюВМассивОпроса(пИмяОрганизации, пАдресБазыПутевыхЛистов, пАдресБазыБухгалтерии = Неопределено, пИмяБазыПутевыхЛистов, пИмяБазыБухгалтерии, пИмяАПИПроизводства)
	мНоваяСтрока = тблБаз.Добавить();
	мНоваяСтрока.Наименование 	= пИмяОрганизации;
	мНоваяСтрока.ВнутреннийАдрес 	= пАдресБазыПутевыхЛистов;
	мНоваяСтрока.ВнутреннийАдресБух = ?(пАдресБазыБухгалтерии = Неопределено, пАдресБазыПутевыхЛистов, пАдресБазыБухгалтерии);
	мНоваяСтрока.APIrestENT 		= пИмяБазыПутевыхЛистов;
	мНоваяСтрока.APIrest 			= пИмяБазыБухгалтерии;
	мНоваяСтрока.ИмяАпиПроизводства = пИмяАПИПроизводства;
	
	мДекорацияОрганизации = Элементы.Добавить("элФ" + тблБаз.Индекс(мНоваяСтрока),Тип("ДекорацияФормы"), Элементы.грпОрг);
	мДекорацияОрганизации.Заголовок = пИмяОрганизации;
	мДекорацияОрганизации.ЦветТекста = WebЦвета.Серый;
КонецПроцедуры

Функция ПолучитьТаблицуЛокально()
	ДобавитьОрганизациюВМассивОпроса("ООО 'НСТ'", "192.168.50.11", , "ENT", "BUH", "prjapi");
	ДобавитьОрганизациюВМассивОпроса("ООО 'МТС'", "192.168.50.11", , "ENTMTS", "BuhMTS", "prjapi");
	ДобавитьОрганизациюВМассивОпроса("ООО 'НВДС'", "192.168.20.13", , "ENT", "buh", "prjapi");
	ДобавитьОрганизациюВМассивОпроса("ООО 'МТК'", "192.168.90.7", , "Proizv", "BUH", "prjapi");
	ДобавитьОрганизациюВМассивОпроса("ООО 'УТТ-Восток'", "192.168.83.9", , "EntUTT", "BuhUTT", "prjapi");
	ДобавитьОрганизациюВМассивОпроса("ООО 'ЧАТ'", "10.8.85.12", , "chat_pl", "chat_bp", "flowAPI");
	ДобавитьОрганизациюВМассивОпроса("ООО 'СТ'", "172.20.0.3", , "ST_ENT", "ST_BUH", "prjapi");
	ДобавитьОрганизациюВМассивОпроса("ООО 'ТС'", "192.168.130.8", "azure1c.westeurope.cloudapp.azure.com", "Ent_TS", "BuhTS", "prjapi");
КонецФункции

&НаСервере
Процедура ОбновитьТблДанные()
	мМассивСтруктурЗапросовКОрганизациям = ПолучитьТаблицуОрганизаций();
	Если ТипЗнч(мМассивСтруктурЗапросовКОрганизациям) = Тип("Строка") Тогда
		ПолучитьТаблицуЛокально();
	Иначе
		Для Каждого мСтрока Из мМассивСтруктурЗапросовКОрганизациям Цикл
			ДобавитьОрганизациюИзСтруктуры(мСтрока);
		КонецЦикла;
		ОбновитьПредставлениеОрганизаций();
	КонецЕсли;
	
	//примерное(!) содержимое таблицы после выполнения
	//ДобавитьОрганизациюВМассивОпроса("ООО 'НСТ'", "192.168.50.11", , "ENT", "BUH", "prjapi");
	//ДобавитьОрганизациюВМассивОпроса("ООО 'МТС'", "192.168.50.11", , "ENTMTS", "BuhMTS", "prjapi");
	//ДобавитьОрганизациюВМассивОпроса("ООО 'НВДС'", "192.168.20.13", , "ENT", "buh", "prjapi");
	//ДобавитьОрганизациюВМассивОпроса("ООО 'МТК'", "192.168.90.7", , "Proizv", "BUH", "prjapi");
	//ДобавитьОрганизациюВМассивОпроса("ООО 'УТТ-Восток'", "192.168.83.9", , "EntUTT", "BuhUTT", "prjapi");
	//ДобавитьОрганизациюВМассивОпроса("ООО 'ЧАТ'", "10.8.85.12", , "chat_pl", "chat_bp", "flowAPI");
	//ДобавитьОрганизациюВМассивОпроса("ООО 'СТ'", "172.20.0.3", , "ST_ENT", "ST_BUH", "prjapi");
	//ДобавитьОрганизациюВМассивОпроса("ООО 'ТС'", "192.168.130.8", "azure1c.westeurope.cloudapp.azure.com", "Ent_TS", "BuhTS", "prjapi");
	
	Для каждого Стр из тблБаз Цикл
		ЗапуститьПолучениеДанныхВФоне(Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТблВМасСтк(Тбл) Экспорт
	
	Рез = новый Массив;
	
	сткСтр = "";
	Для каждого Кол из ТБл.Колонки Цикл
		СткСтр = СткСтр+","+Кол.Имя;
	КонецЦикла;
	СткСтр = Сред(СткСтр,2);
	
	Для каждого Стр из Тбл Цикл
		Стк = Новый Структура(СткСтр);
		ЗаполнитьЗначенияСвойств(Стк,Стр);
		Рез.Добавить(Стк);
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПроверитьФоновыеЗадания(идФЗ)
	рез = Неопределено;
	фз = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(идФЗ);
	Если фз <> Неопределено Тогда
		Если фз.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			РезФЗ = ПолучитьИзВременногоХранилища(фз.Ключ);
			Если ТипЗнч(резФЗ) = Тип("Строка") Тогда
				Рез = Ложь;
			Иначе
				Если резФЗ <> Неопределено Тогда
					рез = ТблВМасСтк(резФЗ[1]);
				Иначе
					Рез = Ложь;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли фз.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура МониторингФоновыхЗаданий() Экспорт
	
	ЕстьНеВыполнено = Ложь;
	ЕстьИзмТблДата  = Ложь;
	ДЛя каждого Стр из тблБаз Цикл
		Если Стр.Выполнено Тогда Продолжить; КонецЕСлИ;
		
		рез = ПроверитьФоновыеЗадания(Стр.ид);
		Если Рез = Ложь Тогда //Ошибка в получении данных
			Стр.колПопыток = Стр.колПопыток+1;
			ЕСли Стр.колПопыток > 5 Тогда
				Стр.выполнено = Истина;
			ИНаче
				Стк = Новый Структура("ВнутреннийАдрес,APIrestENT,Ключ,ид,Выполнено,ИмяАпиПроизводства,ИНН");
				ЗаполнитьЗначенияСвойств(Стк,Стр);
				ЗапуститьПолучениеДанныхВФоне(Стк);
				ЗаполнитьЗначенияСвойств(Стр,Стк);
				
				текЭл = Элементы["ЭлФ"+тблБаз.Индекс(Стр)];
				текЭл.Заголовок = Стр.Наименование+" ("+Стр.колПопыток+")";
			КонецеСЛИ;
		ИНачеЕсли типЗнч(Рез) = Тип("Массив") Тогда
			Стр.Выполнено = Истина;
			
			Для каждого Стк из рез Цикл
				новСтр = тблДата.Добавить();
				ЗаполнитьЗначенияСвойств(новСтр,Стк);
				ЗаполнитьЗначенияСвойств(новСтр,Стр);
				
			КонецЦикла;
			
			ЕстьИзмТблДата = Истина;
			
			Элементы["ЭлФ"+тблБаз.Индекс(Стр)].ЦветТекста = WebЦвета.СинеСерый;

		КонецеСЛИ;
		
		Если Стр.Выполнено = Ложь Тогда
			ЕстьНеВыполнено = Истина;
		КонецесЛИ;
	Конеццикла;
	
	Если ЕстьНеВыполнено=Ложь Тогда
		ОтключитьОбработчикОжидания("МониторингФоновыхЗаданий");
	КонецЕСЛИ;
	
	Если ЕстьИзмТблДата Тогда
		ОбновитьКнопки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТблДанные();
	
	мМассивЛет = СоставитьМассив(Год(ТекущаяДата()), 50);
	//мМассивПростоев = СоставитьМассив(36, 6, 6);
	Элементы.фФильтрГодВыпускаС.СписокВыбора.ЗагрузитьЗначения(мМассивЛет);
	Элементы.фФильтрГодВыпускаПо.СписокВыбора.ЗагрузитьЗначения(мМассивЛет);
	
	//Элементы.ГруппаСтраницыФильтры.ТекущаяСтраница = Элементы.СтраницаФильтрыСкрыты;
	
	фМакет = Обработки.юкПроектПрозрачность.ПолучитьМакет("Макет");
	
	СтрКолонокТблДата = ПолучитьСтрКолонокТблДата();
	//Элементы["ФильтрВПростое00"].ЦветФона = WebЦвета.БледноЗеленый;
	ОбновитьКнопкиИнтерфейса();	//динамические группы и кнопки
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоРодителям()
	мЗапрос = Новый Запрос("ВЫБРАТЬ
	|	уатТипыТС2.Родитель.Код,
	|	уатТипыТС2.Родитель.ИмяПредопределенныхДанных КАК Род1,
	|	уатТипыТС2.Наименование КАК Род2,
	|	"""" КАК Порядок
	|ИЗ
	|	Справочник.уатТипыТС КАК уатТипыТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатТипыТС КАК уатТипыТС2
	|		ПО (уатТипыТС2.Родитель = уатТипыТС.Ссылка)
	|ГДЕ
	|	уатТипыТС2.ЭтоГруппа
	|	И уатТипыТС.Родитель = ЗНАЧЕНИЕ(Справочник.уатТипыТС.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО уатТипыТС2.Родитель.Наименование ВОЗР");
	Возврат мЗапрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ДобавитьГруппу(пИмя, пРодитель, пГоризонтальная = Ложь, пВыделить = Ложь, пЗаголовок = "", пЦветВыделения = Неопределено)
	мНоваяГруппа = Элементы.Добавить(пИмя, Тип("ГруппаФормы"), пРодитель);
	мНоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	мНоваяГруппа.Заголовок = пЗаголовок;
	мНоваяГруппа.ОтображатьЗаголовок = ?(пЗаголовок <> "", Истина, Ложь);
	мНоваяГруппа.Группировка = ?(пГоризонтальная, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	мНоваяГруппа.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	мНоваяГруппа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	мНоваяГруппа.РастягиватьПоВертикали = Ложь;
	мНоваяГруппа.РастягиватьПоГоризонтали = Истина;
	Если пВыделить И Не пГоризонтальная Тогда
		мЭлементДекорацияЧерта = Элементы.Добавить("Декорация" + пИмя, Тип("ДекорацияФормы"), мНоваяГруппа);
		мЭлементДекорацияЧерта.Заголовок = "";
		мЭлементДекорацияЧерта.РастягиватьПоГоризонтали = Истина;
		мЭлементДекорацияЧерта.РастягиватьПоВертикали = Ложь;
		//мЭлементДекорацияЧерта.ЦветФона = WebЦвета.Черный;
		мЭлементДекорацияЧерта.ЦветРамки = ?(пЦветВыделения = Неопределено, WebЦвета.НасыщенноНебесноГолубой, пЦветВыделения);
		мЭлементДекорацияЧерта.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Подчеркивание, 1);
		мЭлементДекорацияЧерта.Шрифт = Новый Шрифт(мЭлементДекорацияЧерта.Шрифт, , 1, Истина);
		мЭлементДекорацияЧерта.Высота = 1;
	КонецЕсли;
	//мНоваяГруппа.ГоризонтальноеПоложение
	//мНоваяГруппа.ГоризонтальноеПоложениеВГруппе
	//мНоваяГруппа.ВертикальноеПоложение
	//мНоваяГруппа.ВертикальноеПоложениеВГруппе
	Возврат мНоваяГруппа;
КонецФункции

&НаСервере
Процедура РаспределитьКнопкиПоГруппам(пИмяГруппБезИндекса, пКоличествоГрупп, пМассивИмен, пИмяРодителяВерхнегоУровня, пИмяКоманды, пСоответствиеЦветовГрупп)
	мИндекс = 0;
	мДелитель = Цел(пМассивИмен.Количество() / пКоличествоГрупп);
	мДелитель = ?(пМассивИмен.Количество() % пКоличествоГрупп = 0, мДелитель, мДелитель + 1);
	Для Каждого мЭлемент Из пМассивИмен Цикл
		//по индексу определим группу
		мИмяГруппы = пИмяГруппБезИндекса + (Цел(мИндекс / мДелитель) + 1);
		ДобавитьКнопку("" + пИмяРодителяВерхнегоУровня + Прав("00"+(мИндекс + 1), 2), "" + мЭлемент, мИмяГруппы, пИмяКоманды, мЭлемент, 3, пСоответствиеЦветовГрупп.Получить(пИмяРодителяВерхнегоУровня));
		Если (мИндекс + 1) <> пМассивИмен.Количество() Тогда
			ДобавитьРастяжитель("РВ" + пИмяРодителяВерхнегоУровня + мИндекс, Элементы[мИмяГруппы], Истина)
		КонецЕсли;
		мИндекс = мИндекс + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопку(пИмя, пЗаголовок, пИмяГруппы, пИмяКоманды, пТекстПодсказки = "", пВысота, пЦвет = Неопределено)
	//добавляем горизонтальную группу, создаем 2 кнопки
	мМиниГруппа = ДобавитьГруппу("ГруппаЗаглушка"+пИмя, Элементы[пИмяГруппы], Истина, Ложь, "");
	мМиниГруппа.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	
	//Заглушка
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить(пИмя + "Заглушка", Тип("КнопкаФормы"), мМиниГруппа);
	НовыйЭлемент.Заголовок = " ";
	НовыйЭлемент.Вид=ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.Ширина = 1;
	НовыйЭлемент.Высота = пВысота;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.МаксимальнаяШирина = 1;
	НовыйЭлемент.ВысотаЗаголовка = пВысота;
	НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
	НовыйЭлемент.ЦветФона = ?(пЦвет = Неопределено, WebЦвета.НасыщенноНебесноГолубой, пЦвет);
	НовыйЭлемент.ЦветРамки = ?(пЦвет = Неопределено, WebЦвета.НасыщенноНебесноГолубой, пЦвет);
	НовыйЭлемент.ЦветТекста = ?(пЦвет = Неопределено, WebЦвета.НасыщенноНебесноГолубой, пЦвет);;
	НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , 10, Истина);
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок = "";
	НовыйЭлемент.МаксимальнаяВысота = пВысота;
	НовыйЭлемент.ИмяКоманды = "Заглушка";
	НовыйЭлемент.Доступность = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	
	//действующая кнопка
	мШирина = 20;
	//НовыйЭлемент = ЭтаФорма.Элементы.Добавить(пИмя, Тип("КнопкаФормы"), Элементы[пИмяГруппы]);
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить(пИмя, Тип("КнопкаФормы"), мМиниГруппа);
	НовыйЭлемент.Заголовок = "" + пЗаголовок;
	НовыйЭлемент.Ширина = мШирина;
	НовыйЭлемент.Высота = пВысота;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	//Если пЗаголовок <> "Все" Тогда
		НовыйЭлемент.МаксимальнаяШирина = 0;
	//КонецЕсли;
	НовыйЭлемент.ВысотаЗаголовка = пВысота;
	НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
	//НовыйЭлемент.ЦветФона = WebЦвета.Лазурный;
	//НовыйЭлемент.ЦветРамки = WebЦвета.Лазурный;
	НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , 10, Истина);
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок = пТекстПодсказки;
	НовыйЭлемент.МаксимальнаяВысота = пВысота;
	НовыйЭлемент.ИмяКоманды = пИмяКоманды;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопки()
	//отменено
КонецПроцедуры

&НаСервере
Процедура ДобавитьРастяжитель(пИмя, пГруппа, пВертикально = Ложь)
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить(пИмя, Тип("ДекорацияФормы"), пГруппа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = " ";
	Если пВертикально Тогда
		НовыйЭлемент.Высота = 1;
		НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
		НовыйЭлемент.МаксимальнаяВысота = 10;
		НовыйЭлемент.РастягиватьПоВертикали = Истина;
	Иначе
		НовыйЭлемент.Ширина = 1;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.МаксимальнаяШирина = 100;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	Конецесли
КонецПроцедуры

&НаСервере
Процедура ОбновитьКнопкиИнтерфейса()
	
	Справочники.уатТипыТС.СинхроТипы();	//синхронизация - гарантия наличия всех типов в справочнике уатТипыТС
	
	мТаблицаРодителей = ПолучитьДанныеПоРодителям();
	мПорядокРодителейВерхнегоУровня = Новый Соответствие;
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.Легковые.ИмяПредопределенныхДанных, "1");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.Автобусы.ИмяПредопределенныхДанных, "2");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.Грузовые.ИмяПредопределенныхДанных, "3");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.Спецтехника.ИмяПредопределенныхДанных, "4");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.Экскаваторы.ИмяПредопределенныхДанных, "5");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.Трактора.ИмяПредопределенныхДанных, "6");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.Прочие.ИмяПредопределенныхДанных, "7");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.ПрицепыИПолуприцепы.ИмяПредопределенныхДанных, "8");
	мПорядокРодителейВерхнегоУровня.Вставить(Справочники.уатТипыТС.ОбородованиеСобственныеНужды.ИмяПредопределенныхДанных, "9");
	
	мСоответствиеЦветовГрупп = Новый Соответствие();
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.Легковые.ИмяПредопределенныхДанных, WebЦвета.ЦветМорскойВолны);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.Автобусы.ИмяПредопределенныхДанных, WebЦвета.Коралловый);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.Грузовые.ИмяПредопределенныхДанных, WebЦвета.ВесеннеЗеленый);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.Спецтехника.ИмяПредопределенныхДанных, WebЦвета.ЗеленоЖелтый);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.Экскаваторы.ИмяПредопределенныхДанных, WebЦвета.Сливовый);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.Трактора.ИмяПредопределенныхДанных, WebЦвета.Оранжевый);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.ПрицепыИПолуприцепы.ИмяПредопределенныхДанных, WebЦвета.НасыщенноНебесноГолубой);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.Прочие.ИмяПредопределенныхДанных, WebЦвета.НейтральноПурпурный);
	мСоответствиеЦветовГрупп.Вставить(Справочники.уатТипыТС.ОбородованиеСобственныеНужды.ИмяПредопределенныхДанных, WebЦвета.ГолубойСоСтальнымОттенком);
	
	мКопияТаблицаРодителей = мТаблицаРодителей.Скопировать();
	мКопияТаблицаРодителей.Свернуть("Род1, Порядок");
	Для Каждого мСтрока Из мКопияТаблицаРодителей Цикл
		мПорядокПоСоответствию = мПорядокРодителейВерхнегоУровня.Получить(мСтрока.Род1);
		мСтрока.Порядок = ?(мПорядокПоСоответствию = Неопределено, "99", мПорядокПоСоответствию);
	КонецЦикла;
	мКопияТаблицаРодителей.Сортировать("Порядок ВОЗР");
	
	мСоответствиеТиповРодителямВерхнегоУровня = Новый Соответствие;
	мМассивРодителейВНаличии = Новый Массив;
	Для каждого мСтрокаРодителей из мТаблицаРодителей Цикл
		Если мМассивРодителейВНаличии.Найти(мСтрокаРодителей.Род1) = Неопределено Тогда
			мМассивРодителейВНаличии.Добавить(мСтрокаРодителей.Род1);
		КонецЕсли;
		мМассивТипов = мСоответствиеТиповРодителямВерхнегоУровня.Получить(мСтрокаРодителей.Род1);
		мДобавляем = Ложь;
		Если мМассивТипов = Неопределено Тогда
			мМассивТипов = Новый Массив;
			мДобавляем = Истина;
		ИначеЕсли мМассивТипов.Найти(мСтрокаРодителей.Род2) = Неопределено Тогда
		 	мДобавляем = Истина;
		КонецЕсли;
		Если мДобавляем Тогда
			мМассивТипов.Добавить(мСтрокаРодителей.Род2);
			мСоответствиеТиповРодителямВерхнегоУровня.Вставить(мСтрокаРодителей.Род1, мМассивТипов);
		КонецЕсли;
	КонецЦикла;
	//сначала группы
	//число отдельных групп
	мЧислоРодителейПервогоУровня = мМассивРодителейВНаличии.Количество();
	//число групп, расположенных вертикально по 2 в ряд
	мЧислоДвойныхГрупп = Цел(мЧислоРодителейПервогоУровня / 2);
	мПоследняяВПредпоследнюю = (мЧислоРодителейПервогоУровня % 2) <> 0;
	//ДобавитьРастяжитель("Р0", Элементы.ГруппаСтолбцов);
	Для Итр = 1 По 2 Цикл
		мНоваяГруппа = ДобавитьГруппу("ГруппаВД" + Итр, Элементы.ГруппаСтолбцов, Истина);
		//создаем вложенные вертикальные группы
		Для Джитр = 1 По мЧислоДвойныхГрупп Цикл
			ДобавитьРастяжитель("РВ" + Итр + Джитр, мНоваяГруппа, Ложь);
			мИндекс = ((Итр - 1) * мЧислоДвойныхГрупп) + Джитр;
			Если мИндекс > мМассивРодителейВНаличии.Количество() Тогда
				Прервать;
			КонецЕсли;
			мРодительВерхнегоУровня = мКопияТаблицаРодителей[(мИндекс - 1)].Род1;
			мПодГруппа = ДобавитьГруппу("ГруппаВ" + мИндекс + Итр, мНоваяГруппа, Ложь, Истина, "" + Справочники.уатТипыТС[мРодительВерхнегоУровня].Наименование, мСоответствиеЦветовГрупп.Получить(мРодительВерхнегоУровня));
			мПодГруппа.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаФормы;
			мПодГруппа.ШрифтЗаголовка = Новый Шрифт(мПодГруппа.ШрифтЗаголовка, , 12, Истина);
			мПодГруппа.Высота = 25;
			
			ДобавитьРастяжитель("РГ" + Итр + Джитр, мНоваяГруппа, Ложь);
			
			//внутри каждой группы создаем гор.группу и кнопку "Все"
			мГорГруппа = ДобавитьГруппу("ГруппаГ" + мИндекс, мПодГруппа, Истина);
			//внутри горизонтальной - 2 вертикальных колонки для кнопок
			мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "1", мГорГруппа);
			мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "2", мГорГруппа);
			////мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "3", мГорГруппа);
			////мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "4", мГорГруппа);
			//распределяем по числу вертикальных групп:
			РаспределитьКнопкиПоГруппам("ГруппаВВ" + мИндекс, 2, мСоответствиеТиповРодителямВерхнегоУровня.Получить(мРодительВерхнегоУровня), мРодительВерхнегоУровня, "ОткрытьОтчет", мСоответствиеЦветовГрупп);
			мГорГруппа = ДобавитьГруппу("ГруппаГГ" + мИндекс, мПодГруппа, Истина);
			ДобавитьКнопку("" + мРодительВерхнегоУровня + "00", "Все", "ГруппаГГ" + мИндекс, "ОткрытьОтчет", "Все ТС в группе '" + мРодительВерхнегоУровня + "'", 2, мСоответствиеЦветовГрупп.Получить(мРодительВерхнегоУровня));
			Если мРодительВерхнегоУровня = "Прочие" Тогда
				ДобавитьКнопку("" + мРодительВерхнегоУровня + "ПП", "Нераспределенные", "ГруппаГГ" + мИндекс, "ОткрытьОтчет", "Все ТС без группы", 2, мСоответствиеЦветовГрупп.Получить(мРодительВерхнегоУровня));
			КонецЕсли;
		КонецЦикла;
		//Если Итр <> мЧислоДвойныхГрупп Тогда
		//	ДобавитьРастяжитель("РГ" + Итр, Элементы.ГруппаСтолбцов);
		//КонецЕсли;
	КонецЦикла;
	Если мПоследняяВПредпоследнюю Тогда	//завернуть внутренности в функцию !
		мИндекс = мКопияТаблицаРодителей.Количество();
		мГруппаПереопределенныйРодитель = Элементы["ГруппаВ" + (мИндекс-1) + 2];
		мРодительВерхнегоУровня = мКопияТаблицаРодителей[мИндекс - 1].Род1;
		мПодГруппа = ДобавитьГруппу("ГруппаВ" + мИндекс + Итр, мГруппаПереопределенныйРодитель, Ложь, Истина, "" + Справочники.уатТипыТС[мРодительВерхнегоУровня].Наименование, мСоответствиеЦветовГрупп.Получить(мРодительВерхнегоУровня));
		//внутри каждой группы создаем гор.группу и кнопку "Все"
		мПодГруппа.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаФормы;
		мПодГруппа.ШрифтЗаголовка = Новый Шрифт(мПодГруппа.ШрифтЗаголовка, , 12, Истина);
		мГорГруппа = ДобавитьГруппу("ГруппаГ" + мИндекс, мПодГруппа, Истина);
		//внутри горизонтальной - 2 вертикальных колонки для кнопок
		мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "1", мГорГруппа);
		мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "2", мГорГруппа);
		////мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "3", мГорГруппа);
		////мВложеннаяПодГруппа = ДобавитьГруппу("ГруппаВВ" + мИндекс + "4", мГорГруппа);
		//распределяем по числу вертикальных групп:
		РаспределитьКнопкиПоГруппам("ГруппаВВ" + мИндекс, 2, мСоответствиеТиповРодителямВерхнегоУровня.Получить(мРодительВерхнегоУровня), мРодительВерхнегоУровня, "ОткрытьОтчет", мСоответствиеЦветовГрупп);
		мГорГруппа = ДобавитьГруппу("ГруппаГГ" + мИндекс, мПодГруппа, Истина);
		ДобавитьКнопку("" + мРодительВерхнегоУровня + "00", "Все", "ГруппаГГ" + мИндекс, "ОткрытьОтчет", "Все ТС в группе '" + мРодительВерхнегоУровня + "'", 2, мСоответствиеЦветовГрупп.Получить(мРодительВерхнегоУровня));
		Если мРодительВерхнегоУровня = "Прочие" Тогда
			ДобавитьКнопку("" + мРодительВерхнегоУровня + "ПП", "Нераспределенные", "ГруппаГГ" + мИндекс, "ОткрытьОтчет", "Все ТС без группы", 2, мСоответствиеЦветовГрупп.Получить(мРодительВерхнегоУровня));
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Группа1.Видимость = Ложь;
	//фСоответствиеТиповРодителямВерхнегоУровня = Новый ФиксированноеСоответствие(мСоответствиеТиповРодителямВерхнегоУровня);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрКолонокТблДата()
	
	РеквизитыТаблицы = ЭтаФорма.ПолучитьРеквизиты("тблДата");
	текСтр = "";
	Для каждого Реквизит из РеквизитыТаблицы Цикл
		текСтр = текСтр+","+Реквизит.Имя;
	КонецЦикла;	
	
	Возврат Сред(текСтр,2);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("МониторингФоновыхЗаданий",1);
	//ОбновитьЭлементыФильтров("ФильтрВПростое");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(пИмяОтчета)
	
	мТекущийЭлемент = ЭтаФорма.ТекущийЭлемент;
	мИмяКнопки = мТекущийЭлемент.Имя;
	мСимволыСправа = Прав(мИмяКнопки, 2);
	фИндексКнопки = мСимволыСправа;
	//получим родителя 1 уровня, т.к. он нужен в любом случае
	//мИмяРодителя = СтрЗаменить(мТекущийЭлемент.Родитель.Родитель.Родитель.Имя, "Группа", "");//можно так, если нужен другой заголовок родителя в группе на форме
	фРодитель = СтрЗаменить(мИмяКнопки, мСимволыСправа, "");
	фРодительВторогоУровня = мТекущийЭлемент.Заголовок;
	//
	//фРодитель = мТекущийЭлемент.Родитель.Родитель.Родитель.Заголовок;//или так, если строка заголовка совпадает с названием родителя
	ПоказатьОтчетНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчетНаКлиенте()
	Если фИндексКнопки = "ПП" Тогда
		ПоказатьОтчет(Неопределено, "", фФильтрНаКонсервации);
	ИначеЕсли фИндексКнопки = "00" Тогда
		ПоказатьОтчет(фРодитель, Неопределено, фФильтрНаКонсервации);
	Иначе
		ПоказатьОтчет(Неопределено, фРодительВторогоУровня, фФильтрНаКонсервации);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчет(пРодитель1, пРодитель2, пПризнакКонсервация)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчет;
	//Элементы.ГруппаСтраницыФильтры.ТекущаяСтраница = Элементы.СтраницаФильтрыОтображены;
	Элементы.ГруппаКнопкаНазад.Видимость = Истина;
	
	#Если ВебКлиент Тогда
	СформироватьОтчетНаКлиенте(пРодитель1, пРодитель2, пПризнакКонсервация, фФильтрМесяцевПростоя, фФильтрГодВыпускаС, фФильтрГодВыпускаПо);
	#Иначе
	фТабличныйДокумент = СформироватьНаСервере(фМакет, пРодитель1, пРодитель2, пПризнакКонсервация, фФильтрМесяцевПростоя, фФильтрГодВыпускаС, фФильтрГодВыпускаПо);
	ОбновитьОтображениеДанных(Элементы.фТабличныйДокумент);
	#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТабДокумент(пМакет,мРезультат)
	мТабличныйДокумент = Новый ТабличныйДокумент;
	мТабличныйДокумент.АвтоМасштаб = Истина;
	мОбластьВсеЯчейки = мТабличныйДокумент.Область("C1:C100");
	мОбластьВсеЯчейки.ЦветФона = Новый Цвет(49, 89, 123);
	мОбластьВсеЯчейки.ЦветРамки = Новый Цвет(255, 255, 255);
	мОбластьВсеЯчейки.ЦветТекста = WebЦвета.Белоснежный;
	
	мОбластьШапкаТаблицы = пМакет.ПолучитьОбласть("Шапка");
	мОбластьГруппа = пМакет.ПолучитьОбласть("Грп");
	мОбластьСтрока = пМакет.ПолучитьОбласть("Строка");
	мОбластьШапкаТаблицы.Параметры.Дт = ТекущаяДата();
	мТабличныйДокумент.Вывести(мОбластьШапкаТаблицы);
	
	мНомерПП = 0;
		
	Для каждого мЭлементМассива Из мРезультат Цикл
		мНомерПП = мНомерПП + 1;
		мОбластьСтрока.Параметры.Заполнить(мЭлементМассива);
		мОбластьСтрока.Параметры.ном = мНомерПП;
		мТабличныйДокумент.Вывести(мОбластьСтрока);
	КонецЦикла;
	
	мТабличныйДокумент.ФиксацияСверху = 3;
	Возврат мТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Функция СформироватьОтчетНаКлиенте(пРодитель1, пРодитель2, пПризнакКонсервация, пФильтрМесяцевПростоя, пФильтрГодВыпускаС, пФильтрГодВыпускаПо)
	Если пРодитель1 = Неопределено Тогда
		мРезультат = ПолучитьДанные( , пРодитель2, пПризнакКонсервация, пФильтрМесяцевПростоя, пФильтрГодВыпускаС, пФильтрГодВыпускаПо);
	Иначе
		мРезультат = ПолучитьДанные(пРодитель1, Неопределено, пПризнакКонсервация, пФильтрМесяцевПростоя, пФильтрГодВыпускаС, пФильтрГодВыпускаПо);
	КонецЕсли;
	мИменаСтруктуры = СтрЗаменить("ГаражныйНомер,ТС,ГосударственныйНомер,ГодВыпуска,ДатаВводаВЭксплуатацию,ДтРаботы,ТипТС,Состояние,Организация", ",", Символы.ПС);
	мИменаШапки = СтрЗаменить("Гар.номер,Наименование,Гос.номер,Год выпуска,Дата ввода,Посл. период работы,ТипТС,Состояние,Организация", ",", Символы.ПС);
	мНомерПП = 0;
	мНомерСтроки = 3;
	фТабличныйДокумент.Область("C1:C20").Очистить(Истина, Ложь, Истина);
	мЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ЗаполнитьДаннымиСтроку(2, 2, , "п/п", мИменаШапки, мЛиния);
	Для Каждого мЭлемент Из мРезультат Цикл
		мНомерПП = мНомерПП + 1;
		//мОбластьСтрока.Параметры.Заполнить(мЭлементМассива);
		//мОбластьСтрока.Параметры.ном = мНомерПП;
		//мТабличныйДокумент.Вывести(мОбластьСтрока);
		ЗаполнитьДаннымиСтроку(мНомерСтроки, 2, мЭлемент, мНомерПП, мИменаСтруктуры, мЛиния);
		мНомерСтроки = мНомерСтроки + 1;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДаннымиСтроку(пСтрока, пСтолбец, пСтруктура = Неопределено, пНомерПП, пИменаСтруктуры, пЛиния)
	
	//фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец-1)).Обвести(пЛиния, пЛиния, пЛиния, пЛиния);
	Для Итр = 0 По СтрЧислоСтрок(пИменаСтруктуры) Цикл
		Если Итр = 0 Тогда
		фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).Текст = пНомерПП;
		Иначе
			Если пСтруктура <> Неопределено Тогда
				фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).Текст = пСтруктура[СокрЛП(СтрПолучитьСтроку(пИменаСтруктуры, Итр))];
			Иначе
				фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).Текст = СокрЛП(СтрПолучитьСтроку(пИменаСтруктуры, Итр));
			КонецЕсли;
		КонецЕсли;
		фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).ГраницаСверху = пЛиния;
		фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).ГраницаСнизу = пЛиния;
		фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).ГраницаСлева = пЛиния;
		фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).ГраницаСправа = пЛиния;
		Если пСтруктура <> Неопределено Тогда
			фТабличныйДокумент.Область("R"+пСтрока+"C"+(пСтолбец + Итр)).Расшифровка=пСтруктура.нсТблДата;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция СформироватьНаСервере(пМакет, пРодитель1, пРодитель2, пПризнакКонсервация, пФильтрМесяцевПростоя, пФильтрГодВыпускаС, пФильтрГодВыпускаПо)
	Если пРодитель1 = Неопределено Тогда
		мРезультат = ПолучитьДанные( , пРодитель2, пПризнакКонсервация, пФильтрМесяцевПростоя, пФильтрГодВыпускаС, пФильтрГодВыпускаПо);
	Иначе
		мРезультат = ПолучитьДанные(пРодитель1, Неопределено, пПризнакКонсервация, пФильтрМесяцевПростоя, пФильтрГодВыпускаС, пФильтрГодВыпускаПо);
	КонецЕсли;
	
	Возврат СформироватьТабДокумент(пМакет, мРезультат);
КонецФункции

&НаКлиенте
Функция ПолучитьДанные(пРодитель1, пРодитель2, пПризнакКонсервация, пФильтрМесяцевПростоя, пФильтрГодВыпускаС, пФильтрГодВыпускаПо)
	мРезультат = Новый Массив;
	Для каждого Стр из тблДата Цикл
		Если пРодитель1 = Неопределено и пРодитель2 = Неопределено Тогда
			Если Лев(Стр.Состояние, 16) <> "Консервация авар" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если  пФильтрГодВыпускаС <> 0 Тогда
			Если Стр.Годвыпуска < пФильтрГодВыпускаС Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		Если  пФильтрГодВыпускаПо <> 0 Тогда
			Если Стр.Годвыпуска > пФильтрГодВыпускаПо Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		Если пПризнакКонсервация Тогда
			Если Стр.этоКонсервация = 0 ТОгда Продолжить; КонецЕсли;
		КонецЕсли;
		
		Если Стр.Род1 <> пРодитель1 И пРодитель1 <> Неопределено Тогда Продолжить; КонецЕсли;
		Если Стр.Род2 <> пРодитель2 И пРодитель2 <> Неопределено Тогда Продолжить; КонецЕсли;
		
		Если пФильтрМесяцевПростоя > Стр.МесяцевПростоя Тогда Продолжить; КонецЕсли;
		
		Стк = Новый Структура(СтрКолонокТблДата);
		ЗаполнитьЗначенияСвойств(Стк, Стр);
		Стк.Вставить("нсТблДата", тблДата.индекс(стр));
		мРезультат.Добавить(Стк);
	КонецЦикла;
	
	Возврат мРезультат;
КонецФункции

//&НаКлиенте
//Процедура ОткрытьПоРодителю(Команда)
//	мИмяЭлемента = Этаформа.ТекущийЭлемент.Имя;
//	мПозицияПодчеркивания = СтрНайти(мИмяЭлемента, "_", , 2);
//	Если мПозицияПодчеркивания > 0 Тогда
//		мИмяЭлемента = Лев(мИмяЭлемента, мПозицияПодчеркивания - 1);
//	КонецЕсли;
//	мИмяВидаОбъектаМетаданных = Этаформа.ТекущийЭлемент.Родитель.Заголовок;
//	мФормаИзСоответствия = фСоответствиеИменФорм.Получить(мИмяВидаОбъектаМетаданных);
//	ОткрытьФорму("" + мИмяВидаОбъектаМетаданных + "." + мИмяЭлемента + "." + ?(мФормаИзСоответствия = Неопределено, ".ФормаСписка", мФормаИзСоответствия));	
//КонецПроцедуры

&НаКлиенте
Процедура НадписьЗаголовокКнопкаВыходНажатие(Элемент)
	Выход(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Выход(Команда)
	мОписаниеОповещенияОбработкаВыбораЗавершениеРаботыСистемы = Новый ОписаниеОповещения("ОбработкаВыбораЗавершениеСистемы", ЭтаФорма);
	ПоказатьВопрос(мОписаниеОповещенияОбработкаВыбораЗавершениеРаботыСистемы , "Завершить работу системы 1С?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗавершениеСистемы(пРезультат, пДополнительныеПараметры) Экспорт
	Если пРезультат <> Неопределено и пРезультат = КодВозвратаДиалога.Да Тогда
		ЗавершитьРаботуСистемы(Истина, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПереключить(Команда)
	мИмяЭлемента = Этаформа.ТекущийЭлемент.Имя;
	ЭтаФорма["ф" + мИмяЭлемента] = НЕ ЭтаФорма["ф" + мИмяЭлемента];
	ОбновитьЭлементыФильтров(мИмяЭлемента);
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчет Тогда
		ПоказатьОтчетНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрУказатьПростой(Команда)
	Элементы["ФильтрВПростое" + Прав("00" + фФильтрМесяцевПростоя, 2)].ЦветФона = WebЦвета.БледноБирюзовый;
	мЗначение = Прав(Этаформа.ТекущийЭлемент.Имя, 2);
	фФильтрМесяцевПростоя = Число(мЗначение);
	Элементы["ФильтрВПростое" + Прав("00" + фФильтрМесяцевПростоя, 2)].ЦветФона = WebЦвета.БледноЗеленый;
	ПоказатьОтчетНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФильтров(пИмяЭлемента)
	мРеквизит = ЭтаФорма["ф" + пИмяЭлемента];
	Элементы[пИмяЭлемента].ЦветФона = ?(мРеквизит, WebЦвета.БледноЗеленый, WebЦвета.БледноБирюзовый);
	Элементы[пИмяЭлемента].Заголовок = ?(мРеквизит, "Вкл", "Выкл");
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаУправление;
	//Элементы.ГруппаСтраницыФильтры.ТекущаяСтраница = Элементы.СтраницаФильтрыСкрыты;
	Элементы.ГруппаКнопкаНазад.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчет Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Назад(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТипыТС(Команда)
	ОткрытьФорму("Справочник.уатТипыТС.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Перезапуск(Команда)
	Закрыть();
	//ОткрытьФорму("Обработка.ОберткаПроектПрозрачность.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СбросФильтров(Команда)
	Элементы["ФильтрВПростое" + Прав("00" + фФильтрМесяцевПростоя, 2)].ЦветФона = WebЦвета.БледноБирюзовый;
	Элементы["ФильтрВПростое00"].ЦветФона = WebЦвета.БледноЗеленый;
	фФильтрМесяцевПростоя = 0;
	фФильтрГодВыпускаС = 0;
	фФильтрГодВыпускаПо = 0;
	ПоказатьОтчетНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура фТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	текСтр = тблДата[Расшифровка];
	
	мПараметры = Новый Структура("GUID_ТС", текСтр.GUID_ТС);
	мПараметры.Вставить("ГаражныйНомер", 	текСтр.ГаражныйНомер);
	мПараметры.Вставить("APIrestENT", 		текСтр.APIrestENT);
	мПараметры.Вставить("APIrest", 			текСтр.APIrest);
	мПараметры.Вставить("ВнутреннийАдрес", 	текСтр.ВнутреннийАдрес);
	мПараметры.Вставить("ВнутреннийАдресБух", 	текСтр.ВнутреннийАдресБух);
	мПараметры.Вставить("ИмяАпиПроизводства", 	текСтр.ИмяАпиПроизводства);
	мПараметры.Вставить("ИНН", 	текСтр.ИНН);
	
	ОткрытьФорму("Обработка.юкПроектПрозрачность.Форма.ФормаТранспортногоСредства", мПараметры, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоАварийным(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчет;
	Элементы.ГруппаКнопкаНазад.Видимость = Истина;
	
	#Если ВебКлиент Тогда
	СформироватьОтчетНаКлиенте(Неопределено, Неопределено, Ложь, 0, 0, 0);
	#Иначе
	фТабличныйДокумент = СформироватьНаСервере(фМакет, Неопределено, Неопределено, Ложь, 0, 0, 0);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Заглушка(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
